/* --------------------------------------------------------- */
/* ИМЯ: Пронкина Тамара Павловна ID пользователя: Uluyluy */
/* СРОК: 10.09.2026 */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ # */
/* ИМЯ ФАЙЛА: prog1.c */
/* НАЗНАЧЕНИЕ ПРОГРАМММЫ: *.
/* ----------------------------------------------------*/
/* ИМЯ: Пронкина Тамара Павловна  ID пользователя: Uluyuluy */
/* СРОК : 10/09/2026 */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ # */
/* ИМЯ ФАЙЛА: prog1.c */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ: Вывод приветствия на консоль */
/* ----------------------------------------------------*/

#include <stdio.h>
#include <unistd.h>

int main() {
    /* Вывод текста в консоль */
    printf("Hello world!\n");
    return 0;
}
