/* ----------------------------------------------------*/
/* ИМЯ: Пронкина Тамара Павловна ID пользователя: Uluyuluy */
/* СРОК : 10/09/2026 */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ # */
/* ИМЯ ФАЙЛА: prog2.c */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ: */
/* Программа выводит текста от пользователя */
/* ----------------------------------------------------*/

#include <stdio.h>
#include <unistd.h>

int main() {
    char text[100];
    printf("Введите текст: ");

    fgets(text, sizeof(text), stdin);

    printf("Вы ввели: %s", text);

    return 0;

}

