#include <stdio.h>
#include <unistd.h>
#include <fcntl.h>

int main(int argc, char *argv[])
{
    int fd; /* файловый дескриптор (номер файла, с которым происходит работа в программе,
             используемой ОС) */
    /* открывает файл (имя которого передано первым аргументом командной строки)
       или создает его, если он не существует */
    fd = open(argv[1],O_CREAT|O_WRONLY|O_TRUNC);
    /* дублирует файловый дескриптор fd в дескриптор 1 (стандартный поток вывода stdout) */
    dup2(fd,1);
    close(fd);
    /* заменяет текущий процесс на выполнение команды, указанной вторым
       аргументом командной строки */
    execvp(argv[2], &argv[2]);
    perror("main");
    return 0;
} 
