/* ----------------------------------------------------*/
/* ИМЯ: Пронкина Тамара Павловна ID пользователя: Uluyuluy */
/* СРОК : 12/10/2026 */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ #3 */
/* ИМЯ ФАЙЛА: dynamic_array.c */
/* НАЗНАЧЕНИЕ ПРОГРАММЫ: Динамическое размещение массива 
   и анализ адресов*/
/* ----------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    int N = 5;
    int *arr;

    arr = (int *)malloc(N * sizeof(int));

    if (arr == NULL) {
        printf("Ошибка выделения памяти\n");
        return 1;
    }

    printf("Анализ одномерного динамического массива:\n");
    int i = 0;
    for (i; i < N; i++) {
        arr[i] = (i + 1) * 10;
        printf("Элемент [%d]: Значение = %d, Адрес = %p\n", i, arr[i], (void*)&arr[i]);
    }

    printf("\nРазница между адресами соседних элементов: %ld байт\n", 
           (long)((char*)&arr[1] - (char*)&arr[0]));

    free(arr);
    arr = NULL;

    return 0;
}